In [3]:
library(dplyr)

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [4]:
#Create test df
df_test <- data.frame(Name = c('Jack','Jack','Jack',
                     'Al','Al','Al','Al',
                     'Sam','Sam','Sam'),
           Date = as.Date(c('2011-10-09','2011-11-09','2011-09-09',
                     '2011-12-09','2011-11-08','2011-11-06','2011-12-29',
                     '2011-10-09','2011-10-09','2010-10-09')),
           City = c('Urbana','Champaign','Urbana',
                     'Dayton','Dayton','N/A',' ',
                     'Lafayette','Lafayette','New Orleans'),
           Sales = c(2000,3000,3050,
                     4000,6000,2000,1500,
                     2500,3000,4000),
           Type  = c('Phone','Person','Person',
                     'Phone','Person','Person','Phone',
                      'Person','Person','Phone') )

In [8]:
#Get Totals to Date of Sales and Phone-Sales

df_test %>% 
    arrange(Name,Date) %>%
    group_by(Name) %>%
    mutate(Num_Sales = row_number(),
           Num_Phone_Sales= cumsum(Type == "Phone"))

   Name Date       City        Sales Type   Num_Sales Num_Phone_Sales
1  Al   2011-11-06 N/A         2000  Person 1         0
2  Al   2011-11-08 Dayton      6000  Person 2         0
3  Al   2011-12-09 Dayton      4000  Phone  3         1
4  Al   2011-12-29             1500  Phone  4         2
5  Jack 2011-09-09 Urbana      3050  Person 1         0
6  Jack 2011-10-09 Urbana      2000  Phone  2         1
7  Jack 2011-11-09 Champaign   3000  Person 3         1
8  Sam  2010-10-09 New Orleans 4000  Phone  1         1
9  Sam  2011-10-09 Lafayette   2500  Person 2         1
10 Sam  2011-10-09 Lafayette   3000  Person 3         1

In [9]:
#Get Totals of pervious Sales and Phone-Sales

df_test %>% 
    arrange(Name,Date) %>%
    group_by(Name) %>%
    mutate(Num_Sales = row_number() - 1 ,
           Num_Phone_Sales= cumsum(Type == "Phone") - as.numeric(Type == "Phone"))

   Name Date       City        Sales Type   Num_Sales Num_Phone_Sales
1  Al   2011-11-06 N/A         2000  Person 0         0
2  Al   2011-11-08 Dayton      6000  Person 1         0
3  Al   2011-12-09 Dayton      4000  Phone  2         0
4  Al   2011-12-29             1500  Phone  3         1
5  Jack 2011-09-09 Urbana      3050  Person 0         0
6  Jack 2011-10-09 Urbana      2000  Phone  1         0
7  Jack 2011-11-09 Champaign   3000  Person 2         1
8  Sam  2010-10-09 New Orleans 4000  Phone  0         0
9  Sam  2011-10-09 Lafayette   2500  Person 1         1
10 Sam  2011-10-09 Lafayette   3000  Person 2         1